{
  "Articles": [
    {
      "title": "Budd Introduces Strategically Lowering Gas Prices Act with Colleagues",
      "link": "https://www.budd.senate.gov/2024/01/24/budd-leads-colleagues-to-introduce-strategically-lowering-gas-prices-act/",
      "summary": "Senator Ted Budd introduced the Strategically Lowering Gas Prices Act aimed at restricting the release of oil from the Strategic Petroleum Reserve until certain executive orders blocking energy development on federal lands are revoked."
    },
    {
      "title": "Budd, Colleagues Propose Bills to Expand Financial Opportunity",
      "link": "https://www.budd.senate.gov/2024/01/31/budd-colleagues-propose-bills-to-expand-financial-opportunity/",
      "summary": "Senator Budd introduced two bills - the Regulation A+ Improvement Act and the Investment Opportunity Expansion Act, to reduce regulations and barriers for Americans starting and growing businesses, and to allow middle-class Americans to invest in private offerings."
    },
    {
      "title": "Senate Passes FY 2024 Defense Bill Including Budd-Secured Wins for NC",
      "link": "https://www.budd.senate.gov/2024/01/31/senate-passes-fy-2024-defense-bill-including-budd-secured-wins-for-nc/",
      "summary": "The Fiscal Year 2024 National Defense Authorization Act, supported by Senator Budd, includes provisions beneficial to North Carolina, like pay raises for servicemembers and funding for military installations in the state."
    },
    {
      "title": "North Carolina U.S. Sen. Ted Budd Endorses Trump for 2024",
      "link": "https://www.wral.com/north-carolina-u-s-sen-ted-budd-endorses-trump-for-2024/20799907/",
      "summary": "Senator Budd has endorsed Donald Trump for the 2024 presidential election, citing Trump's previous economic and global achievements."
    },
    {
      "title": "‘Our patience has run out. Time is up,’ Sen. Ted Budd Tells Qatar",
      "link": "https://jewishinsider.com/2024/01/our-patience-has-run-out-time-is-up-sen-ted-budd-tells-qatar/",
      "summary": "Senator Budd, a vocal critic of Qatar, has demanded action from Qatar regarding its influence on Hamas and the release of hostages."
    },
    {
      "title": "Budd Signs Amicus Brief Defending President Trump's Ballot Access",
      "link": "https://www.budd.senate.gov/2024/01/18/budd-signs-amicus-brief-defending-president-trumps-ballot-access/",
      "summary": "Senator Budd joined an amicus curiae brief to the Supreme Court, urging the reversal of a decision that barred President Trump from the presidential ballot."
    }
  ]
}